Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Reactive Messaging: allows implementing event-driven applications using reactive and imperative code.
ja_jp: リアクティブ・メッセージング: リアクティブ型のコードと命令型のコードを使って、イベントドリブンなアプリケーションを実装することができます。

source: Reactive Microsoft SQL Server Specific Configuration
ja_jp: リアクティブなMicrosoft SQL Server 固有の設定

source: Reactive Microsoft SQL Server client
ja_jp: Reactive Microsoft SQL Serverクライアント

source: Reactive Microsoft SQL Server extension
ja_jp: リアクティブなMicrosoft SQL Serverエクステンション

source: Reactive Microsoft SQL client
ja_jp: Reactive Microsoft SQL クライアント

source: Reactive Microsoft SQL server-specific configuration
ja_jp: Reactive Microsoft SQLサーバー固有の設定

source: Reactive MongoDB Client
ja_jp: リアクティブな MongoDB クライアント

source: Reactive MySQL client
ja_jp: リアクティブMySQLクライアント

source: Reactive MySQL client: an asynchronous and non-blocking client interacting with a MySQL database
ja_jp: リアクティブ MySQL クライアント: MySQL データベースと対話する非同期かつノンブロッキングなクライアント

source: Reactive Oracle Specific Configuration
ja_jp: リアクティブな Oracle 固有の設定

source: Reactive Oracle client
ja_jp: Reactive Oracle クライアント

source: Reactive Oracle-specific configuration
ja_jp: Reactive Oracle固有の設定

source: Reactive PostgreSQL Client extension
ja_jp: リアクティブな PostgreSQL クライアントエクステンション

source: Reactive PostgreSQL Specific Configuration
ja_jp: リアクティブな PostgreSQL 固有の設定

source: Reactive PostgreSQL client
ja_jp: リアクティブなPostgreSQLクライアント

source: Reactive PostgreSQL client: an asynchronous and non-blocking client interacting with a PostgreSQL database, allowing high concurrency.
ja_jp: リアクティブPostgreSQLクライアント：PostgreSQLデータベースと対話する非同期かつノンブロッキングなクライアントで、高い並行性を実現します。

source: Reactive PostgreSQL-specific configuration
ja_jp: Reactive PostgreSQL固有の設定

source: Reactive Programming Models
ja_jp: リアクティブ・プログラミング・モデル

source: Reactive Programming with https://smallrye.io/smallrye-mutiny[Mutiny], and
ja_jp: link:https://smallrye.io/smallrye-mutiny[Mutiny]を用いたリアクティブ・プログラミング、および

source: Reactive Programming with the Cassandra Client
ja_jp: Cassandra クライアントを使用したリアクティブプログラミング

source: Reactive REST Client
ja_jp: リアクティブRESTクライアント

source: Reactive REST endpoints in your application that return Uni or Multi need `Mutiny support for RESTEasy` extension (`io.quarkus:quarkus-resteasy-mutiny`) to work properly:
ja_jp: アプリケーション内で Uni または Multi を返す Reactive REST エンドポイントが正しく動作するには `Mutiny support for RESTEasy` エクステンション ( `io.quarkus:quarkus-resteasy-mutiny` ) が必要です。

source: Reactive Request Processing with Quarkus REST
ja_jp: Quarkus REST を使用したリアクティブなリクエスト処理

source: Reactive Resource
ja_jp: リアクティブリソース

source: Reactive Rest Client: allows consuming HTTP endpoints. Under the hood, it uses the non-blocking I/O features from Quarkus.
ja_jp: Reactive Rest Client: HTTPエンドポイントを消費することができます。フードの下では、QuarkusのノンブロッキングI/O機能を使用しています。

source: Reactive Route Methods
ja_jp: Reactive Routesメソッド

source: Reactive Routes were initially introduced to provide a reactive execution model for HTTP APIs on top of the xref:quarkus-reactive-architecture.adoc[Quarkus Reactive Architecture]. With the introduction of xref:rest.adoc[Quarkus REST (formerly RESTEasy Reactive)], you can now implement reactive HTTP APIs and still use Jakarta REST annotations. Reactive Routes are still supported, especially if you want a more _route-based_ approach, and something closer to the underlying reactive engine.
ja_jp: Reactive Routesは当初、 xref:quarkus-reactive-architecture.adoc[Quarkus Reactive Architecture] 上でHTTP APIのリアクティブ実行モデルを提供するために導入されました。 xref:rest.adoc[Quarkus REST（旧RESTEasy Reactive] ）の導入により、リアクティブなHTTP APIを実装しながら、Jakarta RESTアノテーションを使用できるようになりました。 リアクティブルートは引き続きサポートされており、特に、より _ルートベース_ のアプローチや、基盤となるリアクティブエンジンに近いものを使用したい場合に便利です。

source: Reactive Routes were initially introduced to provide a reactive execution model for HTTP APIs on top of the xref:quarkus-reactive-architecture.adoc[Quarkus Reactive Architecture]. With the introduction of xref:resteasy-reactive.adoc[RESTEasy Reactive], you can now implement reactive HTTP APIs and still use JAX-RS annotations. Reactive Routes are still supported, especially if you want a more _route-based_ approach, and something closer to the underlying reactive engine.
ja_jp: リアクティブ・ルートは当初、 link:quarkus-reactive-architecture.html[Quarkus リアクティブアーキテクチャ]の上にHTTP APIのリアクティブな実行モデルを提供するために導入されました。 link:resteasy-reactive.html[RESTEasy Reactive]の導入により、リアクティブなHTTP APIを実装できるようになり、JAX-RSアノテーションも使用できるようになりました。リアクティブ・ルートは引き続きサポートされています。特に、より _ルートベースの_アプローチや、基礎となるリアクティブ・エンジンに近いものが必要な場合は、そのようにしてください。

source: Reactive Routes were initially introduced to provide a reactive execution model for HTTP APIs on top of the xref:quarkus-reactive-architecture.adoc[Quarkus Reactive Architecture]. With the introduction of xref:resteasy-reactive.adoc[RESTEasy Reactive], you can now implement reactive HTTP APIs and still use Jakarta REST annotations. Reactive Routes are still supported, especially if you want a more _route-based_ approach, and something closer to the underlying reactive engine.
ja_jp: Reactive Routesは当初、 xref:quarkus-reactive-architecture.adoc[Quarkus Reactive Architecture] の上に、HTTP APIのリアクティブな実行モデルを提供するために導入されました。 xref:resteasy-reactive.adoc[RESTEasy Reactive] の導入により、リアクティブなHTTP APIを実装しても、Jakarta RESTアノテーションを使用することができるようになりました。特に、より _ルートベースの_ アプローチや、基盤となるリアクティブエンジンに近いものを求める場合は、リアクティブルートが引き続きサポートされます。

source: Reactive Routes: a declarative way to register HTTP routes directly on the Vert.x router used by Quarkus to route HTTP requests to methods.
ja_jp: Reactive Routes: HTTPリクエストをメソッドにルーティングするためにQuarkusが使用するVert.xルーターに直接HTTPルートを登録する宣言的な方法です。

source: Reactive SQL Clients
ja_jp: リアクティブ SQL クライアント

source: Reactive SQL Clients support multiple datasources
ja_jp: リアクティブ SQL クライアントが複数のデータソースをサポート

source: Reactive System is an architectural style that can be summarized by: distributed systems done right. Relying on asynchronous message passing helps enforce the loose coupling (both in terms of space and time) between the different components. You send messages to virtual destinations. The receiver can be located anywhere, or even not yet exist at the time of the message dispatch. The elasticity pillar allows scaling up and down individual components according to the load. Elasticity also provides redundancy, which helps with the resilience pillar. Failures are inevitable. Components forming a reactive system must handle them gracefully, avoid cascading failures, and self-adapt themselves.
ja_jp: リアクティブシステムは、「分散システムを正しく実現する」という言葉で表現されるアーキテクチャスタイルです。非同期のメッセージパッシングに頼ることで、異なるコンポーネント間の（空間的にも時間的にも）疎結合を実現しています。メッセージは仮想的な宛先に送られます。受信者はどこにでもいることができますし、メッセージ送信時にはまだ存在していないこともあります。弾力性の柱は、負荷に応じて個々のコンポーネントをスケールアップまたはスケールダウンすることができます。また、弾力性は冗長性を提供し、これは回復性の柱に役立ちます。失敗は避けられません。リアクティブシステムを構成するコンポーネントは、障害をグレースフルに処理し、障害の連鎖を回避し、自己適応しなければなりません。

source: Reactive Systems and Quarkus
ja_jp: リアクティブシステムとQuarkus

source: Reactive and Asynchronous APIs
ja_jp: リアクティブと非同期API

source: Reactive and stateless
ja_jp: リアクティブかつステートレス

source: Reactive application toolkit
ja_jp: リアクティブアプリケーションツールキット

source: Reactive applications
ja_jp: リアクティブ・アプリケーション

source: Reactive code on event loop
ja_jp: リアクティブコードでイベントループ上

source: Reactive connection pool size adjustment
ja_jp: リアクティブ接続プールのサイズ調整

source: Reactive datasource
ja_jp: リアクティブデータソース

source: Reactive datasource URL reference
ja_jp: Reactive データソースの URL 参照

source: Reactive datasource configuration reference
ja_jp: Reactive データソース設定リファレンス

source: Reactive datasources can be configured with an `idle-timeout` (in milliseconds). It is the maximum time a connection remains unused in the pool before it is closed.
ja_jp: リアクティブデータソースは、 `idle-timeout` (ミリ秒単位) で設定できます。これは、接続が閉じられる前に、接続がプール内で未使用のままである最大時間です。

source: Reactive datasources can be configured with an `idle-timeout`. It is the maximum time a connection remains unused in the pool before it is closed.
ja_jp: リアクティブデータソースは、 `idle-timeout` で設定できます。これは、接続が閉じられる前に、接続がプール内で未使用のままである最大時間です。

source: Reactive developers may wonder why we can't return a stream of fruits directly. It tends to be a bad idea when dealing with a database. Relational databases do not handle streaming well. It’s a problem of protocols not designed for this use case. So, to stream rows from the database, you need to keep a connection (and sometimes a transaction) open until all the rows are consumed. If you have slow consumers, you break the golden rule of databases: don’t hold connections for too long. Indeed, the number of connections is rather low, and having consumers keeping them for too long will dramatically reduce the concurrency of your application. So, when possible, use a `Uni<List<T>>` and load the content. If you have a large set of results, implement pagination.
ja_jp: リアクティブな開発者は、なぜフルーツのストリームを直接返すことができないのかと思うかもしれません。それは、データベースを扱うときにはよくない考えになりがちです。リレーショナル・データベースはストリーミングをうまく扱えません。これは、このユースケースのために設計されていないプロトコルの問題です。そのため、データベースから行をストリーミングするには、すべての行が消費されるまで、コネクション（場合によってはトランザクション）を開いておく必要があります。コンシューマーが遅い場合、データベースの黄金律である「コネクションを長く保持しない」を破ってしまいます。実際、コネクションの数はかなり少なく、コンシューマーがコネクションを長時間保持することは、アプリケーションの並行性を劇的に低下させます。ですから、可能な限り `Uni<List<T>>` を使用し、コンテンツをロードしてください。結果のセットが大きい場合は、ページネーションを実装してください。

source: Reactive drivers at the rescue
ja_jp: リアクティブドライバによる救いの手

source: Reactive execution model
ja_jp: リアクティブ実行モデル

source: Reactive extensions
ja_jp: リアクティブエクステンション

source: Reactive health checks
ja_jp: リアクティブヘルスチェック

source: Reactive message processing
ja_jp: リアクティブ型メッセージ処理

source: Reactive routes propose an alternative approach to implement HTTP endpoints where you declare and chain _routes_. This approach became very popular in the JavaScript world, with frameworks like Express.Js or Hapi. Quarkus also offers the possibility to use reactive routes. You can implement REST API with routes only or combine them with JAX-RS resources and servlets.
ja_jp: Reactive Routesは、HTTPエンドポイントを実装するために、 _routes_ を宣言して連鎖させる代替アプローチを提案します。このアプローチは、Express.JsやHapiのようなフレームワークで、JavaScriptの世界で非常に人気があります。Quarkusは、Reactive Routesを使用する可能性も提供しています。ルートのみでREST APIを実装することもできますし、JAX-RSリソースやサーブレットと組み合わせて実装することもできます。

source: Reactive routes propose an alternative approach to implement HTTP endpoints where you declare and chain _routes_. This approach became very popular in the JavaScript world, with frameworks like Express.Js or Hapi. Quarkus also offers the possibility to use reactive routes. You can implement REST API with routes only or combine them with Jakarta REST resources and servlets.
ja_jp: Reactive routesは、HTTPエンドポイントを実装するための代替アプローチを提案するもので、 _ルート_ を宣言してチェインさせるものです。このアプローチは、Express.JsやHapiのようなフレームワークで、JavaScriptの世界で非常に人気がありました。Quarkusも、リアクティブルートを使用する可能性を提供します。ルートだけでREST APIを実装したり、Jakarta RESTリソースやサーブレットと組み合わせたりすることができます。

source: Reactive startup methods
ja_jp: リアクティブ起動メソッド

source: Reactive transaction support inside MongoDB with Panache is still experimental.
ja_jp: Panache を使用した MongoDB 内のリアクティブトランザクションサポートはまだ実験段階です。

source: Reactive transactions
ja_jp: リアクティブトランザクション

source: Reactive underneath does not mean you must write reactive code. Quarkus offers three development models:
ja_jp: リアクティブが内部にあるからといって、リアクティブコードを書かなければならないわけではありません。Quarkusは3つの開発モデルを提供しています。

source: Read & avail. at build time
ja_jp: ビルド時に読取、利用可

source: Read <<in-memory-databases,Testing with in-memory databases>> (below) for suggestions regarding integration testing.
ja_jp: 統合テストに関する提案については、<<in-memory-databases,Testing with in-memory databases>> (下) をお読みください。

source: Read <<in-memory-databases,Testing with in-memory databases>> for suggestions regarding integration testing.
ja_jp: 結合テストに関する提案については、 xref:in-memory-databases[インメモリデータベースを使ったテスト] をお読みください。

source: Read Encrypted Configuration
ja_jp: 暗号化された設定の読み取り

source: Read about Cloud Events
ja_jp: Cloud Events についての記事を読む

source: Read about the community plans for the future. Here is <a href="https://github.com/orgs/quarkusio/projects/5">our current roadmap</a>. This is driven by the community, come and tell us what <i>your</i> needs are.
ja_jp: 将来に向けた、コミュニティの計画を読んでみて下さい。現在の<a href="https://github.com/orgs/quarkusio/projects/5">我々のコミュニティロードマップ</a>はこちらです。 Quarkusはコミュニティ駆動であり、<i>あなた</i>のニーズが何であるか、教えてください。

source: Read about the use of logging API in Quarkus, configuring logging output, and using logging adapters to unify the output from other logging APIs.
ja_jp: QuarkusでのロギングAPIの使用、ロギング出力の設定、他のロギングAPIからの出力を統一するためのロギングアダプタの使用について解説します。

source: Read about the use of logging API in {project-name}, configuring logging output, and using logging adapters to unify the output from other logging APIs.
ja_jp: {project-name} でのロギング API の使用、ロギング出力の設定、他のロギング API からの出力を統一するためのロギングアダプターの使用について解説します。

source: Read about xref:funqy.adoc[Funqy Basics]. This is a short read!
ja_jp: link:funqy[Funqy の基礎] を読む。短時間で読めます!

source: Read and write objects to a database
ja_jp: データベースへのオブジェクトの読み書き

source: Read and write the entity
ja_jp: エンティティの読み書き

source: Read during static init
ja_jp: Static Init 時の読み取り

source: Read full article
ja_jp: 全文を読む

source: Read more about it in the xref:infinispan-client-reference.adoc[Infinispan reference] in the Annotation based serialization section.
ja_jp: 詳細は、アノテーションベースのシリアル化セクションの xref:infinispan-client-reference.adoc[Infinispan リファレンス] を参照してください。

source: Read more on the `@TemplateExtension` https://quarkus.io/guides/qute#template-extension-methods[here].
ja_jp: 詳しくは link:https://quarkus.io/guides/qute#template-extension-methods[こちら]（ `@TemplateExtension` ）をご覧ください。

source: Read only deployment environments
ja_jp: 読み取り専用のデプロイメント環境

source: Read the Guide
ja_jp: ガイドを読む

source: Read the great article "Native Java in the Real World" describing how Microservices on Kubernetes are the business case sweet spot for native Java because they have the most significant framework and Java runtime overhead. As well as How to use Camel extensions for Quarkus to build powerful Java Integrations. There is a cool short step-by-step guide to create a new microservice in "Reactive Timer Microservice with Java Quartz, DynamoDB and Quarkus". Get the baseline knowledge and understanding Reactive Messaging with Apache Kafka with "Getting Started to Quarkus Reactive Messaging with Apache Kafka". "Process Formula 1 telemetry with Quarkus and OpenShift Streams for Apache Kafka" is a great article showing how race team engineers can exploit multiple software technologies to process telemetry data in a Java application in real time. Follow up with "3 Reasons Why All Java Developers Should Consider Quarkus".
ja_jp: Kubernetes上のマイクロサービスは、フレームワークとJavaランタイムのオーバーヘッドが最も大きいため、ネイティブJavaのビジネスケースのスイートスポットであることが説明されている素晴らしい記事 "Native Java in the Real World"をお読みください。また、Quarkus用のCamelエクステンションを使用して、強力なJava統合を構築する方法についても説明しています。また、"Reactive Timer Microservice with Java Quartz, DynamoDB and Quarkus"では、新しいマイクロサービスを作成するための簡単なステップバイステップガイドが用意されています。また、"Getting Started to Quarkus Reactive Messaging with Apache Kafka"では、Apache Kafkaを使用したReactive Messagingの基本的な知識と理解を得ることができます。"Process Formula 1 telemetry with Quarkus and OpenShift Streams for Apache Kafka" は、レースチームのエンジニアが複数のソフトウェア技術を活用して、Javaアプリケーションで遠隔測定データをリアルタイムに処理する方法を紹介する優れた記事です。"すべてのJava開発者がQuarkusを検討すべき3つの理由" をフォローアップしています。

source: Read the xref:opentracing.adoc[OpenTracing] guide, for how to configure OpenTracing and how to use the Jaeger tracer.
ja_jp: OpenTracingの設定方法やJaegerトレーサーの使用方法については、 link:opentracing.html[OpenTracing]ガイドをお読みください。

source: Read xref:./virtual-threads.adoc[the virtual thread guide] for more details.
ja_jp: 詳しくは xref:./virtual-threads.adoc[バーチャル・スレッド・ガイド] をお読みください。

source: Reader and Writer interceptors
ja_jp: リーダーおよびライターインターセプター

source: Readers and Writers: mapping entities and HTTP bodies
ja_jp: リーダーとライター: マッピングエンティティーと HTTP ボディ

source: Readiness health check
ja_jp: Rediness ヘルスチェック

source: Readiness health check. Also available at `/q/health/ready` endpoint.
ja_jp: Rediness ヘルスチェック。 `/q/health/ready` エンドポイントでも利用可能。

source: Reading Class Bytecode
ja_jp: クラスバイトコードの読み取り

source: Reading a file and storing the content in memory works for small files, but not big ones. In this section, we will see how you can use Vert.x streaming capability.
ja_jp: ファイルを読み込んで内容をメモリに保存する方法は、小さなファイルには有効ですが、大きなファイルには使えません。このセクションでは、Vert.xのストリーミング機能をどのように使用するかを説明します。

source: Reading and writing to the database seems to be working well, but that's a bit unexpected. Where did a PostgreSQL database come from? You didn't set anything up.
ja_jp: データベースの読み取りと書き込みは正常に動作しているようですが、これは少し予想外のことです。 PostgreSQL データベースは、何も設定されていないはずですが、どこから取得されたのですか?

source: Reading annotations
ja_jp: アノテーションの読み込み

source: Reading data
ja_jp: データの読み取り

source: Reading properties from Spring Cloud Config Server
ja_jp: Spring Cloud Config Serverからのプロパティの読み込み

source: Reading the entity is now allowed because we're executing the mapper on the worker thread pool.
ja_jp: ワーカースレッドプールでマッパーを実行しているため、エンティティの読み取りが許可されるようになりました。

source: Reading through the RESTEasy Reactive documentation you soon come across the new APIs for writing request filters (https://quarkus.io/guides/resteasy-reactive#request-or-response-filters[@ServerRequestFilter]), response filters (`@ServerResponseFilter`) and exception mappers (https://quarkus.io/guides/resteasy-reactive#exception-mapping[@ServerExceptionMapper]). You might wonder if their usage affects performance in any way compared to the standard JAX-RS APIs (`ContainerRequestFilter`, `ContainerResponseFilter` and `ExceptionMapper`).
ja_jp: RESTEasy Reactive のドキュメントを読むと、すぐにリクエストフィルター link:https://quarkus.io/guides/resteasy-reactive#request-or-response-filters[(@ServerRequestFilter])、レスポンスフィルター (`@ServerResponseFilter`)、例外マッパー link:https://quarkus.io/guides/resteasy-reactive#exception-mapping[(@ServerExceptionMapper]) を記述するための新しい API に出くわします。これらの使用法が標準の JAX-RS API (`ContainerRequestFilter`, `ContainerResponseFilter`, `ExceptionMapper`) と比べてパフォーマンスに影響を与えるかどうかを疑問に思うかもしれません。

source: Realism is more important than squeezing out every last bit of performance.
ja_jp: パフォーマンスの最後のひとひねりまで絞り出すことよりも、現実性が重要です。

source: Rebuild the binary using:
ja_jp: 次のようにバイナリを再ビルドします。

source: Recap
ja_jp: 要約

source: Recap of HTTP based Testing in JVM mode
ja_jp: JVM モードでの HTTP ベースのテストの要約

source: Receive a payload by serving HTTP requests using Quarkus REST,
ja_jp: Quarkus REST を使用して HTTP リクエストを処理し、ペイロードを受信します。

source: Receive a payload by serving HTTP requests using RESTEasy Reactive,
ja_jp: RESTEasy Reactive を使用して HTTP リクエストを処理することにより、ペイロードを受信します。

source: Receive notifications when task states change
ja_jp: タスクの状態が変化した時の通知の受信

source: Receive the message payload as a method parameter. The returned object will be the reply.
ja_jp: メッセージのペイロードをメソッドのパラメーターとして受け取ります。返されたオブジェクトがリプライとなります。

source: Receive the messages sent to the `greeting` address
ja_jp: `greeting` アドレスに送信されたメッセージを受信

source: Receive the messages sent to the address configured with the `my.consumer.address` key.
ja_jp: `my.consumer.address` キーで設定されたアドレスに送信されたメッセージを受信します。

source: Receives the Vert.x instance as a constructor parameter
ja_jp: コンストラクタのパラメータとしてVert.xインスタンスを受け取ります。

source: Receiving AMQP messages
ja_jp: AMQP メッセージの受信

source: Receiving Cloud Events
ja_jp: クラウドイベントの受信

source: Receiving Kafka Records in Batches
ja_jp: バッチでの Kafka レコードの受信

source: Receiving Multipart Messages
ja_jp: マルチパートメッセージの受信

source: Receiving Pulsar Messages in Batches
ja_jp: Pulsar メッセージの一括受信

source: Receiving RabbitMQ messages
ja_jp: RabbitMQ メッセージの受信

source: Receiving compressed messages
ja_jp: 圧縮メッセージの受信

source: Receiving messages from Kafka
ja_jp: Kafka からのメッセージの受信

source: Receiving messages from Pulsar
ja_jp: Pulsar からのメッセージの受信

source: Receiving quotes
ja_jp: 見積の受け取り

source: Recent Blog Posts
ja_jp: 最近のブログ記事

source: Recent CPU utilization for the process as reported by the JVM.
ja_jp: JVM によって報告される、プロセスの最近の CPU 使用率。

source: Recently, we have rewritten most of our bytecode generation to use Gizmo 2, which is built on top of the Class-File API. This work is still ongoing, but key components such as ArC, our CDI implementation, are already relying on it.
ja_jp: 最近、私たちはバイトコード生成のほとんどを、Class-File API を基盤とする Gizmo 2 を使用するように書き換えました。この作業はまだ進行中ですが、当社の CDI 実装である ArC などの主要コンポーネントはすでにこれに依存しています。

source: Reciprocally, multiple producers on the same channel can be merged by setting `mp.messaging.incoming.$channel.merge=true`. On the `@Incoming` methods, you can control how multiple channels are merged using the `@Merge` annotation.
ja_jp: 反対に、 `mp.messaging.incoming.$channel.merge=true` を設定することで、同じチャネル上の複数のプロデューサーをマージできます。 `@Incoming` メソッドでは、 `@Merge` アノテーションを使用して複数のチャネルをマージする方法を制御できます。

source: Recommend Streams From
ja_jp: 推奨ストリーム元

source: Recommend how to fix the issue
ja_jp: 問題の修正方法を推奨する

source: Recommendations
ja_jp: 推奨事項

source: Recommendations for secure token encryption:
ja_jp: 安全なトークン暗号化に関する推奨事項:

source: Recommended GraalVM version to use.
ja_jp: 使用する GraalVM の推奨バージョン。

source: Recompile the application, rebuild the binary and run it. Attempting a simple curl will never complete, as expected:
ja_jp: アプリケーションを再コンパイルし、バイナリを再ビルドして実行します。単純なcurlを試みても、期待通り完了しません。

source: Recompiling the Quarkus application with `-Dquarkus.native.debug.enabled` and rerunning it through `gdb` we are now able to get a backtrace making clear what caused the crash. On top of that, add `-H:-OmitInlinedMethodDebugLineInfo` option to avoid inlined methods being omitted from the backtrace:
ja_jp: `-Dquarkus.native.debug.enabled` でQuarkusアプリケーションを再コンパイルし、 `gdb` で再実行すると、クラッシュの原因を明らかにするバックトレースを得ることができます。さらに、 `-H:-OmitInlinedMethodDebugLineInfo` オプションを追加すると、インライン化されたメソッドがバックトレースから省略されるのを防ぐことができます。

source: Reconsume later and retry letter topic
ja_jp: 後の再消費と再試行レタートピック

source: Record classes are also supported, so you could rewrite the previous example as a record:
ja_jp: レコードクラスもサポートされているため、前の例をレコードとして書き直すことができます。

source: Record the value of the roll.
ja_jp: ロールの値を記録します。

source: Records are a good fit for projection classes.
ja_jp: レコードは射影クラスに適しています。

source: Records information about Quarkus application running. This event includes the name of the application and its version.
ja_jp: Quarkus アプリケーションの実行に関する情報を記録します。このイベントには、アプリケーション名とそのバージョンが含まれます。

source: Records information about Quarkus running. This event includes the Quarkus version, its profiles, and the mode in which it is running.
ja_jp: Quarkus の実行に関する情報を記録します。このイベントには、Quarkus のバージョン、プロファイル、および実行モードが含まれます。

source: Records information about extensions included in the running Quarkus. This event includes the name of the extensions installed in Quarkus.
ja_jp: 実行中の Quarkus に含まれるエクステンションに関する情報を記録します。このイベントには、Quarkus にインストールされているエクステンションの名前が含まれます。

source: Records the end of the REST server process.
ja_jp: REST サーバープロセスの終了を記録します。

source: Records the start of the REST server process.
ja_jp: REST サーバープロセスの開始を記録します。

source: Records the time period from the start of the REST server process to the end of the REST server process.
ja_jp: REST サーバープロセスの開始から終了までの時間を記録します。

source: Recovery processing is periodic (the default period between recovery passes is 2 minutes). If you cannot wait 2 minutes then you may manually trigger a recovery cycle via the coordinators recovery endpoint as follows:
ja_jp: リカバリー処理は定期的に行われます（リカバリーパスのデフォルトの期間は2分です）。2分も待てない場合は、コーディネーターのリカバリーエンドポイントを使って、以下のように手動でリカバリーサイクルを開始することができます。

source: Red Hat Product Security Bulletin
ja_jp: Red Hat 製品セキュリティ情報

source: Redirect control properties
ja_jp: リダイレクト制御プロパティー

source: Redirect support
ja_jp: リダイレクトサポート

source: Redirecting to and from the OIDC provider
ja_jp: OIDC プロバイダーへのリダイレクトと OIDC プロバイダーからのリダイレクト

source: Redirection
ja_jp: リダイレクト

source: Redirection file
ja_jp: リダイレクトファイル

source: Redis Cache
ja_jp: Redisキャッシュ

source: Redis Client
ja_jp: Redisクライアント

source: Redis Client (for the pub/sub commands)
ja_jp: Redisクライアント（pub/subコマンド用）

source: Redis Extension Reference Guide
ja_jp: Redis エクステンションのリファレンスガイド

source: Redis Health Check
ja_jp: Redis ヘルスチェック

source: Redis Reference
ja_jp: Redisリファレンス
